from io import StringIO
import os
import struct
import sys


# 以360度色相颜色，生成360个颜色用于HSV取色器的SL二维渐变绘制显示
# 用于连续索引ID的素材组生成

def 生成色相素材组(output_file):
    # 设定起始初始参数
    索引起始值=1073751000
    生成数量=360

    # 是无符号的4字节
    # 0~360度的色相颜色，360个，0~359，整数十六进制格式AARRGGBB
    ARGB颜色值 = [4294901760, 4294902784, 4294903808, 4294904832, 4294905856, 4294907136, 4294908160, 4294909184, 4294910208, 4294911488, 4294912512, 4294913536, 4294914560, 4294915840, 4294916864, 4294917888, 4294918912, 4294920192, 4294921216, 4294922240, 4294923264, 4294924544, 4294925568, 4294926592, 4294927872, 4294928896, 4294929920, 4294930944, 4294932224, 4294933248, 4294934272, 4294935296, 4294936576, 4294937600, 4294938624, 4294939648, 4294940928, 4294941952, 4294942976, 4294944000, 4294945280, 4294946304, 4294947328, 4294948352, 4294949632, 4294950656, 4294951680, 4294952704, 4294953984, 4294955008, 4294956032, 4294957056, 4294958336, 4294959360, 4294960384, 4294961408, 4294962688, 4294963712, 4294964736, 4294965760, 4294967040, 4294639360, 4294377216, 4294115072, 4293852928, 4293525248, 4293263104, 4293000960, 4292738816, 4292411136, 4292148992, 4291886848, 4291624704, 4291297024, 4291034880, 4290772736, 4290510592, 4290182912, 4289920768, 4289658624, 4289396480, 4289068800, 4288806656, 4288544512, 4288282368, 4287954688, 4287692544, 4287430400, 4287168256, 4286840576, 4286578432, 4286316288, 4285988608, 4285726464, 4285464320, 4285202176, 4284874496, 4284612352, 4284350208, 4284088064, 4283760384, 4283498240, 4283236096, 4282973952, 4282646272, 4282384128, 4282121984, 4281859840, 4281532160, 4281270016, 4281007872, 4280745728, 4280418048, 4280155904, 4279893760, 4279631616, 4279303936, 4279041792, 4278779648, 4278517504, 4278255360, 4278255364, 4278255368, 4278255372, 4278255377, 4278255381, 4278255385, 4278255389, 4278255393, 4278255398, 4278255402, 4278255406, 4278255411, 4278255415, 4278255419, 4278255423, 4278255427, 4278255432, 4278255436, 4278255440, 4278255445, 4278255449, 4278255453, 4278255457, 4278255461, 4278255466, 4278255470, 4278255474, 4278255479, 4278255483, 4278255487, 4278255491, 4278255495, 4278255500, 4278255504, 4278255508, 4278255513, 4278255517, 4278255521, 4278255525, 4278255529, 4278255534, 4278255538, 4278255542, 4278255547, 4278255551, 4278255555, 4278255559, 4278255563, 4278255568, 4278255572, 4278255576, 4278255581, 4278255585, 4278255589, 4278255593, 4278255597, 4278255602, 4278255606, 4278255610, 4278255615, 4278254335, 4278253311, 4278252287, 4278251007, 4278249983, 4278248959, 4278247935, 4278246911, 4278245631, 4278244607, 4278243583, 4278242303, 4278241279, 4278240255, 4278239231, 4278238207, 4278236927, 4278235903, 4278234879, 4278233599, 4278232575, 4278231551, 4278230527, 4278229503, 4278228223, 4278227199, 4278226175, 4278224895, 4278223871, 4278222847, 4278221823, 4278220799, 4278219519, 4278218495, 4278217471, 4278216191, 4278215167, 4278214143, 4278213119, 4278212095, 4278210815, 4278209791, 4278208767, 4278207487, 4278206463, 4278205439, 4278204415, 4278203391, 4278202111, 4278201087, 4278200063, 4278198783, 4278197759, 4278196735, 4278195711, 4278194687, 4278193407, 4278192383, 4278191359, 4278190335, 4278452479, 4278714623, 4278976767, 4279238911, 4279566591, 4279828735, 4280090879, 4280418559, 4280680703, 4280942847, 4281204991, 4281532671, 4281794815, 4282056959, 4282319103, 4282581247, 4282908927, 4283171071, 4283433215, 4283695359, 4284023039, 4284285183, 4284547327, 4284875007, 4285137151, 4285399295, 4285661439, 4285989119, 4286251263, 4286513407, 4286775551, 4287037695, 4287365375, 4287627519, 4287889663, 4288151807, 4288479487, 4288741631, 4289003775, 4289331455, 4289593599, 4289855743, 4290117887, 4290445567, 4290707711, 4290969855, 4291231999, 4291494143, 4291821823, 4292083967, 4292346111, 4292608255, 4292935935, 4293198079, 4293460223, 4293787903, 4294050047, 4294312191, 4294574335, 4294902015, 4294902010, 4294902006, 4294902002, 4294901998, 4294901993, 4294901989, 4294901985, 4294901980, 4294901976, 4294901972, 4294901968, 4294901963, 4294901959, 4294901955, 4294901951, 4294901947, 4294901942, 4294901938, 4294901934, 4294901930, 4294901925, 4294901921, 4294901917, 4294901912, 4294901908, 4294901904, 4294901900, 4294901895, 4294901891, 4294901887, 4294901883, 4294901879, 4294901874, 4294901870, 4294901866, 4294901862, 4294901857, 4294901853, 4294901849, 4294901844, 4294901840, 4294901836, 4294901832, 4294901827, 4294901823, 4294901819, 4294901815, 4294901811, 4294901806, 4294901802, 4294901798, 4294901794, 4294901789, 4294901785, 4294901781, 4294901776, 4294901772, 4294901768, 4294901764]


    # 素材组名称
    素材组名 = "色相ID_"
    素材内容名 = "素材内容_"
    
    # 程序运行内使用的
    当前生成ID = 0 # 生成计数

    # 未知素材唯一ID，根据生成数量后顺序追加
    素唯一ID起始 = 索引起始值 + (生成数量 * 2)

    # 素材内内容ID
    素材内内容ID = 索引起始值 + (生成数量 * 1)

    # 素材段
    素材组段="  '502:"
    素材内容段="  '502:"
    
    # 排序ID
    排序ID=268
    
    # 素材组信息
    # 缩放（对于素材组本身是无效的）
    组缩X=1.0
    组缩Y=1.0
    组缩Z=1.0
    # 大小
    组W=256.0
    组H=256.0
    # 位置（素材组位置信息，0.0,0.0为屏幕显示中心）
    组位X=0.0
    组位Y=0.0
    
    # 未知2（可能是自定义锚点，但是对于素材组本身无效）
    组锚MinX=0.5
    组锚MinY=0.5
    
    # 未知3（可能是自定义锚点，但是对于素材组本身无效）
    组锚MaxX=0.5
    组锚MaxY=0.5
    
    # 未知4（可能是自定义锚点，但是对于素材组本身无效）
    组锚中心X=0.5
    组锚中心Y=0.5
    
    # 未知5（可能是旋转信息，是空的，没有数值或默认时是空）
    组保留未知5=0.0
    # 素材组内内容信息
    # 缩放
    素缩X=1.0
    素缩Y=1.0
    素缩Z=1.0
    # 大小
    素W=256.0
    素H=256.0
    # 位置（素材组位置信息，0.0,0.0为屏幕显示中心）
    素位X=0.0
    素位Y=0.0
    
    # Min（自定义锚点）
    素锚MinX=0.5
    素锚MinY=0.5
    
    # Max（自定义锚点）
    素锚MaxX=0.5
    素锚MaxY=0.5
    
    # 中心（自定义锚点）
    素锚中心X=0.5
    素锚中心Y=0.5
    
    # 旋转
    素旋=0.0
    
    # 内容引用资产ID
    素内容引用ID = 106092
    
    参数00=""
    # 拼接字符串太多了，这里用字符串数组
    参数组 = [""] * 138 # 列表138个空项

    # 素材组段
    # 排序ID
    参数组[0] = f"{素材组段}{排序ID:02d}"
    参数组[1] = ":embedded message': \n        {\n          '501:00:Varint': "
    # 自身素材ID
    参数组[2] = f"{索引起始值 + 当前生成ID}"
    参数组[3] = ",\n          '502:01:embedded message': \n            {\n              '11:00:embedded message': \n                {\n                  '501:00:Varint': "
    # 自身素材ID
    参数组[4] = f"{索引起始值 + 当前生成ID}"
    参数组[5] = "\n                },\n              '501:01:Varint': 1,\n              '502:02:Varint': 5\n            },\n          '502:02:embedded message': \n            {\n              '12:00:embedded message': \n                {\n                  '501:00:Varint': 1\n                },\n              '501:01:Varint': 2,\n              '502:02:Varint': 6\n            },\n          '502:03:embedded message': \n            {\n              '14:00:embedded message': \n                {\n                },\n              '501:01:Varint': 4,\n              '502:02:Varint': 4\n            },\n          '502:04:embedded message': \n            {\n              '16:00:embedded message': \n                {\n                  '11:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 1\n                },\n              '501:01:Varint': 6,\n              '502:02:Varint': 55,\n              '503:03:embedded message': \n                {\n                  '46:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 39,\n                  '502:02:Varint': 55,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 自身素材ID
    参数组[6] = f"{索引起始值 + 当前生成ID}"
    参数组[7] = "\n                    }\n                }\n            },\n          '503:05:repeated': ["
    # 自身容器内内容ID
    参数组[8] = f"{素材内内容ID + 当前生成ID}"
    参数组[9] = "],\n          '505:06:embedded message': \n            {\n              '12:00:embedded message': \n                {\n                  '501:00:string': '"
    # 自身名称
    参数组[10] = f"{素材组名}{当前生成ID}"
    参数组[11] = "'\n                },\n              '501:01:Varint': 2,\n              '502:02:Varint': 15\n            },\n          '505:07:embedded message': \n            {\n              '11:00:embedded message': \n                {\n                  '12:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 2\n                },\n              '501:01:Varint': 1,\n              '502:02:Varint': 12,\n              '503:03:embedded message': \n                {\n                  '13:00:embedded message': \n                    {\n                      '12:00:embedded message': \n                        {\n                          '501:00:embedded message': \n                            {\n                              '502:00:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    
    # 未知自身内唯一数值（ID）
    # 参数组[12] = f"{素唯一ID起始 + 当前生成ID}"
    # 参数组[13] =""
    # 自身素材ID
    # 参数组[14] = f"{索引起始值 + 当前生成ID}"
    # 参数组[15] = ""
    # 自身容器内内容ID
    # 参数组[16] = f"{素材内内容ID + 当前生成ID}"
    # 参数组[17] = ""
    # 自身名称
    # 参数组[18] = f"{素材组名}{当前生成ID}"
    # 以下是素材组自身的位置缩大小锚点遮罩信息等
    # 参数组[19] =""
    
    # 组缩放X
    参数组[20] = f"{组缩X}"
    参数组[21] = ",\n                                      '02:01:32-bit': "
    # 组缩放Y
    参数组[22] = f"{组缩Y}"
    参数组[23] = ",\n                                      '03:02:32-bit': "
    # 组缩放Z
    参数组[24] = f"{组缩Z}"
    参数组[25] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MinX
    参数组[26] = f"{组锚MinX}"
    参数组[27] = ",\n                                      '502:01:32-bit': "
    # 组锚MinY
    参数组[28] = f"{组锚MinY}"
    参数组[29] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MaxX
    参数组[30] = f"{组锚MaxX}"
    参数组[31] = ",\n                                      '502:01:32-bit': "
    # 组锚MaxY
    参数组[32] = f"{组锚MaxY}"

    # 参数组[33] = ""
    # 组位X
    # 参数组[34] = f"{组位X}"
    # 参数组[35] = ""
    # 组位Y
    # 参数组[36] = f"{组位Y}"

    参数组[37] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组W
    参数组[38] = f"{组W}"
    参数组[39] = ",\n                                      '502:01:32-bit': "
    # 组H
    参数组[40] = f"{组H}"
    参数组[41] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚中心X
    参数组[42] = f"{组锚中心X}"
    参数组[43] = ",\n                                      '502:01:32-bit': "
    # 组锚中心Y
    参数组[44] = f"{组锚中心Y}"

    # 参数组[45] = ""
    # 保留未知（可能是素材组自身旋转）
    # 参数组[46] = f"{组保留未知5}"

    # 未知的第一次信息
    参数组[47] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                    }\n                                }\n                            },\n                          '501:01:embedded message': \n                            {\n                              '501:00:Varint': 1,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    # 组缩放X
    参数组[48] =  f"{组缩X}"
    参数组[49] = ",\n                                      '02:01:32-bit': "
    # 组缩放Y
    参数组[50] =  f"{组缩Y}"
    参数组[51] = ",\n                                      '03:02:32-bit': "
    # 组缩放Z
    参数组[52] =  f"{组缩Z}"
    参数组[53] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MinX
    参数组[54] = f"{组锚MinX}"
    参数组[55] = ",\n                                      '502:01:32-bit': "
    # 组锚MinY
    参数组[56] = f"{组锚MinY}"
    参数组[57] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MaxX
    参数组[58] = f"{组锚MaxX}"
    参数组[59] = ",\n                                      '502:01:32-bit': "
    # 组锚MaxY
    参数组[60] = f"{组锚MaxY}"

    # 参数组[61] = ""
    # 组位X
    # 参数组[62] =  f"{组位X}"
    # 参数组[63] = ""
    # 组位Y
    # 参数组[64] =  f"{组位Y}"

    参数组[65] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组W
    参数组[66] =  f"{组W}"
    参数组[67] = ",\n                                      '502:01:32-bit': "
    # 组H
    参数组[68] =  f"{组H}"
    参数组[69] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚中心X
    参数组[70] = f"{组锚中心X}"
    参数组[71] = ",\n                                      '502:01:32-bit': "
    # 组锚中心Y
    参数组[72] = f"{组锚中心Y}"

    # 参数组[73] = ""
    # 保留未知（可能是素材组自身旋转）
    # 参数组[74] =  f"{组保留未知5}"

    # 未知的第二次信息
    参数组[75] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                    }\n                                }\n                            },\n                          '501:02:embedded message': \n                            {\n                              '501:00:Varint': 2,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    参数组[76] =  f"{组缩X}"
    参数组[77] = ",\n                                      '02:01:32-bit': "
    # 组缩放Y
    参数组[78] =  f"{组缩Y}"
    参数组[79] = ",\n                                      '03:02:32-bit': "
    # 组缩放Z
    参数组[80] =  f"{组缩Z}"
    参数组[81] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MinX
    参数组[82] = f"{组锚MinX}"
    参数组[83] = ",\n                                      '502:01:32-bit': "
    # 组锚MinY
    参数组[84] = f"{组锚MinY}"
    参数组[85] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MaxX
    参数组[86] = f"{组锚MaxX}"
    参数组[87] = ",\n                                      '502:01:32-bit': "
    # 组锚MaxY
    参数组[88] = f"{组锚MaxY}"

    # 参数组[89] = ""
    # 组位X
    # 参数组[90] =  f"{组位X}"
    # 参数组[91] = ""
    # 组位Y
    # 参数组[92] =  f"{组位Y}"

    参数组[93] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组W
    参数组[94] =  f"{组W}"
    参数组[95] = ",\n                                      '502:01:32-bit': "
    # 组H
    参数组[96] =  f"{组H}"
    参数组[97] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚中心X
    参数组[98] = f"{组锚中心X}"
    参数组[99] = ",\n                                      '502:01:32-bit': "
    # 组锚中心Y
    参数组[100] = f"{组锚中心Y}"

    # 参数组[101] = "\n                                        },\n                                      '508:06:embedded message': \n                                        {\n                                          '501:00:32-bit': "
    # 保留未知（可能是素材组自身旋转）
    # 参数组[102] = f"{组保留未知5}"

    # 未知的第三次信息
    参数组[103] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                    }\n                                }\n                            },\n                          '501:03:embedded message': \n                            {\n                              '501:00:Varint': 3,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    参数组[104] =  f"{组缩X}"
    参数组[105] = ",\n                                      '02:01:32-bit': "
    # 组缩放Y
    参数组[106] =  f"{组缩Y}"
    参数组[107] = ",\n                                      '03:02:32-bit': "
    # 组缩放Z
    参数组[108] =  f"{组缩Z}"
    参数组[109] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MinX
    参数组[110] = f"{组锚MinX}"
    参数组[111] = ",\n                                      '502:01:32-bit': "
    # 组锚MinY
    参数组[112] = f"{组锚MinY}"
    参数组[113] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚MaxX
    参数组[114] = f"{组锚MaxX}"
    参数组[115] = ",\n                                      '502:01:32-bit': "
    # 组锚MaxY
    参数组[116] = f"{组锚MaxY}"

    # 参数组[117] = ""
    # 组位X
    # 参数组[118] =  f"{组位X}"
    # 参数组[119] = ""
    # 组位Y
    # 参数组[120] =  f"{组位Y}"

    参数组[121] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组W
    参数组[122] =  f"{组W}"
    参数组[123] = ",\n                                      '502:01:32-bit': "
    # 组H
    参数组[124] =  f"{组H}"
    参数组[125] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 组锚中心X
    参数组[126] = f"{组锚中心X}"
    参数组[127] = ",\n                                      '502:01:32-bit': "
    # 组锚中心Y
    参数组[128] = f"{组锚中心Y}"

    # 参数组[129] = "\n                                        },\n                                      '508:06:embedded message': \n                                        {\n                                          '501:00:32-bit': "
    # 保留未知（可能是素材组自身旋转）
    # 参数组[130] = f"{组保留未知5}"

    参数组[131] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                    }\n                                }\n                            },\n                          '504:04:Varint': 1\n                        },\n                      '501:01:Varint': 2\n                    },\n                  '501:01:Varint': 4,\n                  '502:02:Varint': 12,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 自身素材ID
    参数组[132] = f"{索引起始值 + 当前生成ID}"
    参数组[133] = "\n                    }\n                }\n            },\n          '505:08:embedded message': \n            {\n              '14:00:embedded message': \n                {\n                  '15:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 5\n                },\n              '501:01:Varint': 4,\n              '502:02:Varint': 23,\n              '503:03:embedded message': \n                {\n                  '14:00:embedded message': \n                    {\n                      '15:00:embedded message': \n                        {\n                        },\n                      '501:01:Varint': 5\n                    },\n                  '501:01:Varint': 5,\n                  '502:02:Varint': 23,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 自身素材ID
    参数组[134] = f"{索引起始值 + 当前生成ID}"
    # 以下包含遮罩信息，形状位置大小等
    参数组[135] = "\n                    }\n                }\n            },\n          '505:09:embedded message': \n            {\n              '46:00:embedded message': \n                {\n                },\n              '501:01:Varint': 38,\n              '502:02:Varint': 56,\n              '503:03:embedded message': \n                {\n                  '47:00:embedded message': \n                    {\n                      '01:00:embedded message': \n                        {\n                        },\n                      '02:01:embedded message': \n                        {\n                          '501:00:32-bit': 50.0,\n                          '502:01:32-bit': 50.0\n                        },\n                      '03:02:Varint': 2\n                    },\n                  '501:01:Varint': 40,\n                  '502:02:Varint': 56,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 自身素材ID
    参数组[136] = f"{索引起始值 + 当前生成ID}"
    参数组[137] = "\n                    }\n                }\n            }\n        },\n"

    # 拼合参数 = "".join(参数组) # 拼接数组

    内参数组 = [""] * 137 # 列表137个空项
    # 素材内容段
    内参数组[0] = 素材内容段
    # 排序ID
    内参数组[1] = f"{排序ID:02d}"
    内参数组[2] = ":embedded message': \n        {\n          '501:00:Varint': "
    # 容器内容ID
    内参数组[3] = f"{素材内内容ID + 当前生成ID}"
    内参数组[4] = ",\n          '502:01:embedded message': \n            {\n              '11:00:embedded message': \n                {\n                  '501:00:Varint': "
    # 容器内容ID
    内参数组[5] = f"{素材内内容ID + 当前生成ID}"
    内参数组[6] = "\n                },\n              '501:01:Varint': 1,\n              '502:02:Varint': 5\n            },\n          '502:02:embedded message': \n            {\n              '12:00:embedded message': \n                {\n                  '501:00:Varint': 2\n                },\n              '501:01:Varint': 2,\n              '502:02:Varint': 6\n            },\n          '504:03:Varint': "
    # 容器对应的素材组ID
    内参数组[7] = f"{索引起始值 + 当前生成ID}"
    内参数组[8] = ",\n          '505:04:embedded message': \n            {\n              '12:00:embedded message': \n                {\n                  '501:00:string': '"
    # 素材内容名
    内参数组[9] = f"{素材内容名}{当前生成ID}"
    内参数组[10] = "'\n                },\n              '501:01:Varint': 2,\n              '502:02:Varint': 15\n            },\n          '505:05:embedded message': \n            {\n              '14:00:embedded message': \n                {\n                  '15:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 5\n                },\n              '501:01:Varint': 4,\n              '502:02:Varint': 23,\n              '503:03:embedded message': \n                {\n                  '14:00:embedded message': \n                    {\n                      '15:00:embedded message': \n                        {\n                        },\n                      '501:01:Varint': 5\n                    },\n                  '501:01:Varint': 5,\n                  '502:02:Varint': 23,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 容器内容ID
    内参数组[11] = f"{素材内内容ID + 当前生成ID}"

    # 内参数组[12] = ""
    # 素材内容名
    # 内参数组[13] = f"{素材内容名}{当前生成ID}"
    # 内参数组[14] = ""
    # 容器内容ID
    # 内参数组[15] = f"{素材内内容ID + 当前生成ID}"

    # 以下是容器素材的位置大小信息等
    内参数组[16] = "\n                    }\n                }\n            },\n          '505:06:embedded message': \n            {\n              '11:00:embedded message': \n                {\n                  '12:00:embedded message': \n                    {\n                    },\n                  '501:01:Varint': 2\n                },\n              '501:01:Varint': 1,\n              '502:02:Varint': 12,\n              '503:03:embedded message': \n                {\n                  '13:00:embedded message': \n                    {\n                      '12:00:embedded message': \n                        {\n                          '501:00:embedded message': \n                            {\n                              '502:00:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    # 素缩X
    内参数组[17] = f"{素缩X}"
    内参数组[18] = ",\n                                      '02:01:32-bit': "
    # 素缩Y
    内参数组[19] = f"{素缩Y}"
    内参数组[20] = ",\n                                      '03:02:32-bit': "
    # 素缩Z
    内参数组[21] = f"{素缩Z}"
    内参数组[22] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MinX
    内参数组[23] = f"{素锚MinX}"
    内参数组[24] = ",\n                                      '502:01:32-bit': "
    # 素锚MinY
    内参数组[25] = f"{素锚MinY}"
    内参数组[26] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MaxX
    内参数组[27] = f"{素锚MaxX}"
    内参数组[28] = ",\n                                      '502:01:32-bit': "
    # 素锚MaxY
    内参数组[29] = f"{素锚MaxY}"

    内参数组[30] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素位X
    内参数组[31] = f"{素位X}"
    内参数组[32] = ",\n                                      '502:01:32-bit': "
    # 素位Y
    内参数组[33] = f"{素位Y}"

    内参数组[34] = "\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素W
    内参数组[35] = f"{素W}"
    内参数组[36] = ",\n                                      '502:01:32-bit': "
    # 素H
    内参数组[37] = f"{素H}"
    内参数组[38] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚中心X
    内参数组[39] = f"{素锚中心X}"
    内参数组[40] = ",\n                                      '502:01:32-bit': "
    #  素锚中心Y
    内参数组[41] = f"{素锚中心Y}"
    内参数组[42] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                      '03:00:32-bit': "
    # 素旋
    内参数组[43] = f"{素旋}"

    # 以下是未知第一次信息
    内参数组[44] = "\n                                    }\n                                }\n                            },\n                          '501:01:embedded message': \n                            {\n                              '501:00:Varint': 1,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    # 素缩X
    内参数组[45] = f"{素缩X}"
    内参数组[46] = ",\n                                      '02:01:32-bit': "
    # 素缩Y
    内参数组[47] = f"{素缩Y}"
    内参数组[48] = ",\n                                      '03:02:32-bit': "
    # 素缩Z
    内参数组[49] = f"{素缩Z}"
    内参数组[50] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MinX
    内参数组[51] = f"{素锚MinX}"
    内参数组[52] = ",\n                                      '502:01:32-bit': "
    # 素锚MinY
    内参数组[53] = f"{素锚MinY}"
    内参数组[54] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MaxX
    内参数组[55] = f"{素锚MaxX}"
    内参数组[56] = ",\n                                      '502:01:32-bit': "
    # 素锚MaxY
    内参数组[57] = f"{素锚MaxY}"
    内参数组[58] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素位X
    内参数组[59] = f"{素位X}"
    内参数组[60] = ",\n                                      '502:01:32-bit': "
    # 素位Y
    内参数组[61] = f"{素位Y}"
    内参数组[62] = "\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素W
    内参数组[63] = f"{素W}"
    内参数组[64] = ",\n                                      '502:01:32-bit': "
    # 素H
    内参数组[65] = f"{素H}"
    内参数组[66] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚中心X
    内参数组[67] = f"{素锚中心X}"
    内参数组[68] = ",\n                                      '502:01:32-bit': "
    # 素锚中心Y
    内参数组[69] = f"{素锚中心Y}"
    内参数组[70] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                      '03:00:32-bit': "
    # 素旋
    内参数组[71] = f"{素旋}"

    # 以下是未知第二次信息
    内参数组[72] = "\n                                    }\n                                }\n                            },\n                          '501:02:embedded message': \n                            {\n                              '501:00:Varint': 2,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    # 素缩X
    内参数组[73] = f"{素缩X}"
    内参数组[74] = ",\n                                      '02:01:32-bit': "
    # 素缩Y
    内参数组[75] = f"{素缩Y}"
    内参数组[76] = ",\n                                      '03:02:32-bit': "
    # 素缩Z
    内参数组[77] = f"{素缩Z}"
    内参数组[78] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MinX
    内参数组[79] = f"{素锚MinX}"
    内参数组[80] = ",\n                                      '502:01:32-bit': "
    # 素锚MinY
    内参数组[81] = f"{素锚MinY}"
    内参数组[82] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MaxX
    内参数组[83] = f"{素锚MaxX}"
    内参数组[84] = ",\n                                      '502:01:32-bit': "
    # 素锚MaxY
    内参数组[85] = f"{素锚MaxY}"
    内参数组[86] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素位X
    内参数组[87] = f"{素位X}"
    内参数组[88] = ",\n                                      '502:01:32-bit': "
    # 素位Y
    内参数组[89] = f"{素位Y}"
    内参数组[90] = "\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素W
    内参数组[91] = f"{素W}"
    内参数组[92] = ",\n                                      '502:01:32-bit': "
    # 素H
    内参数组[93] = f"{素H}"
    内参数组[94] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚中心X
    内参数组[95] = f"{素锚中心X}"
    内参数组[96] = ",\n                                      '502:01:32-bit': "
    # 素锚中心Y
    内参数组[97] = f"{素锚中心Y}"
    内参数组[98] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                      '03:00:32-bit': "
    # 素旋
    内参数组[99] = f"{素旋}"

    # 以下是未知第三次信息
    内参数组[100] = "\n                                    }\n                                }\n                            },\n                          '501:03:embedded message': \n                            {\n                              '501:00:Varint': 3,\n                              '502:01:embedded message': \n                                {\n                                  '501:00:embedded message': \n                                    {\n                                      '01:00:32-bit': "
    # 素缩X
    内参数组[101] = f"{素缩X}"
    内参数组[102] = ",\n                                      '02:01:32-bit': "
    # 素缩Y
    内参数组[103] = f"{素缩Y}"
    内参数组[104] = ",\n                                      '03:02:32-bit': "
    # 素缩Z
    内参数组[105] = f"{素缩Z}"
    内参数组[106] = "\n                                    },\n                                  '502:01:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MinX
    内参数组[107] = f"{素锚MinX}"
    内参数组[108] = ",\n                                      '502:01:32-bit': "
    # 素锚MinY
    内参数组[109] = f"{素锚MinY}"
    内参数组[110] = "\n                                    },\n                                  '503:02:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚MaxX
    内参数组[111] = f"{素锚MaxX}"
    内参数组[112] = ",\n                                      '502:01:32-bit': "
    # 素锚MaxY
    内参数组[113] = f"{素锚MaxY}"
    内参数组[114] = "\n                                    },\n                                  '504:03:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素位X
    内参数组[115] = f"{素位X}"
    内参数组[116] = ",\n                                      '502:01:32-bit': "
    # 素位Y
    内参数组[117] = f"{素位Y}"
    内参数组[118] = "\n                                    },\n                                  '505:04:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素W
    内参数组[119] = f"{素W}"
    内参数组[120] = ",\n                                      '502:01:32-bit': "
    # 素H
    内参数组[121] = f"{素H}"
    内参数组[122] = "\n                                    },\n                                  '506:05:embedded message': \n                                    {\n                                      '501:00:32-bit': "
    # 素锚中心X
    内参数组[123] = f"{素锚中心X}"
    内参数组[124] = ",\n                                      '502:01:32-bit': "
    # 素锚中心Y
    内参数组[125] = f"{素锚中心Y}"
    内参数组[126] = "\n                                    },\n                                  '508:06:embedded message': \n                                    {\n                                      '03:00:32-bit': "
    # 素旋
    内参数组[127] = f"{素旋}"

    # 以下是素材的设置引用、颜色、拉伸模式等
    内参数组[128] = "\n                                    }\n                                }\n                            },\n                          '502:04:Varint': 9,\n                          '504:05:Varint': 1\n                        },\n                      '501:01:Varint': 2\n                    },\n                  '501:01:Varint': 4,\n                  '502:02:Varint': 12,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 容器内容ID
    内参数组[129] = f"{素材内内容ID + 当前生成ID}"
    内参数组[130] = "\n                    }\n                }\n            },\n          '505:07:embedded message': \n            {\n              '31:00:embedded message': \n                {\n                },\n              '501:01:Varint': 21,\n              '502:02:Varint': 38,\n              '503:03:embedded message': \n                {\n                  '31:00:embedded message': \n                    {\n                      '02:00:Varint': "
    # 静态引用资产ID
    内参数组[131] = f"{素内容引用ID}"
    内参数组[132] = ",\n                      '03:01:embedded message': \n                        {\n                          '501:00:Varint': 18446744073709551615\n                        },\n                      '04:02:Varint': "
    # 填充颜色（ARGB）
    内参数组[133] = f"{ARGB颜色值[当前生成ID]}"
    内参数组[134] = ",\n                      '05:03:Varint': 1,\n                      '06:04:embedded message': \n                        {\n                        },\n                      '10:05:embedded message': \n                        {\n                        }\n                    },\n                  '501:01:Varint': 22,\n                  '502:02:Varint': 38,\n                  '503:03:Varint': 1,\n                  '504:04:embedded message': \n                    {\n                      '02:00:Varint': 1,\n                      '03:01:Varint': 8,\n                      '04:02:Varint': "
    # 容器内容ID
    内参数组[135] = f"{素材内内容ID + 当前生成ID}"
    内参数组[136] = "\n                    }\n                }\n            }\n        },\n"





    引用参数2="  '03:"
    引用参数3=":string': '"
    引用参数4="-\\色相素材组03.gia',\n"
    引用参数5="  '05:"
    引用参数6=":string': '"
    版本号="6.7.0"
    引用参数7="'\n}"

    # 预拼接模板 + StringIO 批量写入
    # 缓冲区
    buffer = StringIO()

    # 开始
    当前生成ID = 0
    # 501:00:repeated
    数组501 =[]
    for 当前生成ID in range(生成数量): 
        数组501.append(f"{索引起始值 + 当前生成ID}")
    拼合参数 = ", ".join(数组501)
    with open(f"{output_file}_索引repeated.txt", "w", encoding="utf-8") as f:
        f.write(f"{拼合参数}")

    buffer.write(参数00)
    当前生成ID = 0
    for 当前生成ID in range(生成数量): # 生成循环，先生成素材组容器
        参数组[0] = f"{素材组段}{排序ID:02d}"
        参数组[2] = f"{索引起始值 + 当前生成ID}"
        参数组[4] = f"{索引起始值 + 当前生成ID}"
        参数组[6] = f"{索引起始值 + 当前生成ID}"
        参数组[8] = f"{素材内内容ID + 当前生成ID}"
        参数组[10] = f"{素材组名}{当前生成ID}"
        
        参数组[20] = f"{组缩X}"
        参数组[22] = f"{组缩Y}"
        参数组[24] = f"{组缩Z}"
        参数组[26] = f"{组锚MinX}"
        参数组[28] = f"{组锚MinY}"
        参数组[30] = f"{组锚MaxX}"
        参数组[32] = f"{组锚MaxY}"
        参数组[38] = f"{组W}"
        参数组[40] = f"{组H}"
        参数组[42] = f"{组锚中心X}"
        参数组[44] = f"{组锚中心Y}"


        参数组[48] =  f"{组缩X}"
        参数组[50] =  f"{组缩Y}"
        参数组[52] =  f"{组缩Z}"
        参数组[54] = f"{组锚MinX}"
        参数组[56] = f"{组锚MinY}"
        参数组[58] = f"{组锚MaxX}"
        参数组[60] = f"{组锚MaxY}"
        参数组[66] =  f"{组W}"
        参数组[68] =  f"{组H}"
        参数组[70] = f"{组锚中心X}"
        参数组[72] = f"{组锚中心Y}"


        参数组[76] =  f"{组缩X}"
        参数组[78] =  f"{组缩Y}"
        参数组[80] =  f"{组缩Z}"
        参数组[82] = f"{组锚MinX}"
        参数组[84] = f"{组锚MinY}"
        参数组[86] = f"{组锚MaxX}"
        参数组[88] = f"{组锚MaxY}"
        参数组[94] =  f"{组W}"
        参数组[96] =  f"{组H}"
        参数组[98] = f"{组锚中心X}"
        参数组[100] = f"{组锚中心Y}"

        参数组[104] =  f"{组缩X}"
        参数组[106] =  f"{组缩Y}"
        参数组[108] =  f"{组缩Z}"
        参数组[110] = f"{组锚MinX}"
        参数组[112] = f"{组锚MinY}"
        参数组[114] = f"{组锚MaxX}"
        参数组[116] = f"{组锚MaxY}"
        参数组[122] =  f"{组W}"
        参数组[124] =  f"{组H}"
        参数组[126] = f"{组锚中心X}"
        参数组[128] = f"{组锚中心Y}"

        参数组[132] = f"{索引起始值 + 当前生成ID}"
        参数组[134] = f"{索引起始值 + 当前生成ID}"
        参数组[136] = f"{索引起始值 + 当前生成ID}"


        拼合参数 = "".join(参数组) # 拼接数组
        buffer.write(拼合参数)
        排序ID+=1

        内参数组[0] = 素材内容段
        内参数组[1] = f"{排序ID:02d}"
        内参数组[3] = f"{素材内内容ID + 当前生成ID}"
        内参数组[5] = f"{素材内内容ID + 当前生成ID}"
        内参数组[7] = f"{索引起始值 + 当前生成ID}"
        内参数组[9] = f"{素材内容名}{当前生成ID}"
        内参数组[11] = f"{素材内内容ID + 当前生成ID}"

        内参数组[17] = f"{素缩X}"
        内参数组[19] = f"{素缩Y}"
        内参数组[21] = f"{素缩Z}"
        内参数组[23] = f"{素锚MinX}"
        内参数组[25] = f"{素锚MinY}"
        内参数组[27] = f"{素锚MaxX}"
        内参数组[29] = f"{素锚MaxY}"
        内参数组[31] = f"{素位X}"
        内参数组[33] = f"{素位Y}"
        内参数组[35] = f"{素W}"
        内参数组[37] = f"{素H}"
        内参数组[39] = f"{素锚中心X}"
        内参数组[41] = f"{素锚中心Y}"
        内参数组[43] = f"{素旋}"

        内参数组[45] = f"{素缩X}"
        内参数组[47] = f"{素缩Y}"
        内参数组[49] = f"{素缩Z}"
        内参数组[51] = f"{素锚MinX}"
        内参数组[53] = f"{素锚MinY}"
        内参数组[55] = f"{素锚MaxX}"
        内参数组[57] = f"{素锚MaxY}"
        内参数组[59] = f"{素位X}"
        内参数组[61] = f"{素位Y}"
        内参数组[63] = f"{素W}"
        内参数组[65] = f"{素H}"
        内参数组[67] = f"{素锚中心X}"
        内参数组[69] = f"{素锚中心Y}"
        内参数组[71] = f"{素旋}"

        内参数组[73] = f"{素缩X}"
        内参数组[75] = f"{素缩Y}"
        内参数组[77] = f"{素缩Z}"
        内参数组[79] = f"{素锚MinX}"
        内参数组[81] = f"{素锚MinY}"
        内参数组[83] = f"{素锚MaxX}"
        内参数组[85] = f"{素锚MaxY}"
        内参数组[87] = f"{素位X}"
        内参数组[89] = f"{素位Y}"
        内参数组[91] = f"{素W}"
        内参数组[93] = f"{素H}"
        内参数组[95] = f"{素锚中心X}"
        内参数组[97] = f"{素锚中心Y}"
        内参数组[99] = f"{素旋}"

        内参数组[101] = f"{素缩X}"
        内参数组[103] = f"{素缩Y}"
        内参数组[105] = f"{素缩Z}"
        内参数组[107] = f"{素锚MinX}"
        内参数组[109] = f"{素锚MinY}"
        内参数组[111] = f"{素锚MaxX}"
        内参数组[113] = f"{素锚MaxY}"
        内参数组[115] = f"{素位X}"
        内参数组[117] = f"{素位Y}"
        内参数组[119] = f"{素W}"
        内参数组[121] = f"{素H}"
        内参数组[123] = f"{素锚中心X}"
        内参数组[125] = f"{素锚中心Y}"
        内参数组[127] = f"{素旋}"

        内参数组[129] = f"{素材内内容ID + 当前生成ID}"
        内参数组[131] = f"{素内容引用ID}"
        内参数组[133] = f"{ARGB颜色值[当前生成ID]}"
        内参数组[135] = f"{素材内内容ID + 当前生成ID}"

        拼合参数 = "".join(内参数组) # 拼接数组
        buffer.write(拼合参数)
        排序ID+=1

    # ========== 一次性写入文件 ==========
    with open(f"{output_file}.proto", "w", encoding="utf-8") as f:
        f.write(buffer.getvalue())
    print(f"本次生成{当前生成ID+1}个素材组 数据写入{output_file}")
    print(f"最后的排序ID：{排序ID}")


if __name__ == '__main__':
    if len(sys.argv) != 2:
        print("用法: python script.py <输出文件>")
        sys.exit(1)

    output_file = sys.argv[1]
    生成色相素材组(output_file)








